tlouwers/STM32F4-DISCOVERY/drivers/drivers/I2C/I2C.cpp
/**
 * \file I2C.cpp
 *
 * \licence "THE BEER-WARE LICENSE" (Revision 42):
 *          <terry.louwers@fourtress.nl> wrote this file. As long as you retain
 *          this notice you can do whatever you want with this stuff. If we
 *          meet some day, and you think this stuff is worth it, you can buy me
 *          a beer in return.
 *                                                                Terry Louwers
 *
 * \brief   I2C master peripheral driver class.
 *
 * \note    https://github.com/tlouwers/STM32F4-DISCOVERY/tree/develop/drivers/I2C
 *
 * \author  T. Louwers <terry.louwers@fourtress.nl>
 * \version 1.1
 * \date    05-2021
 */

/************************************************************************/
/* Includes                                                             */
/************************************************************************/
#include "drivers/I2C/I2C.hpp"
#include "utility/Assert/Assert.h"
#include "utility/ScopedIrqMask/ScopedIrqMask.hpp"
#include "stm32f4xx_hal_i2c.h"


/************************************************************************/
/* Static variables                                                     */
/************************************************************************/
static I2CCallbacks i2c1_callbacks {};
static I2CCallbacks i2c2_callbacks {};
static I2CCallbacks i2c3_callbacks {};


/************************************************************************/
/* Static functions                                                     */
/************************************************************************/
/**
 * \brief   Call the callbackEvent, if configured.
 * \param   i2c_callbacks   Structure containing the callbackEvent to call.
 */
static void CallbackEvent(const I2CCallbacks& i2c_callbacks)
{
    if (i2c_callbacks.callbackEvent)
    {
        i2c_callbacks.callbackEvent();
    }
}

/**
 * \brief   Call the callbackError, if configured.
 * \param   i2c_callbacks   Structure containing the callbackError to call.
 */
static void CallbackError(const I2CCallbacks& i2c_callbacks)
{
    if (i2c_callbacks.callbackError)
    {
        i2c_callbacks.callbackError();
    }
}

/**
 * \brief   Fire and clear the callbackTx slot.
 * \param   i2c_callbacks   Structure containing the callbackTx to call.
 * \param   success         True if the transfer completed successfully,
 *                          false on bus error or aborted transfer.
 * \details The slot is cleared before invocation so the user handler is
 *          guaranteed to fire at most once per transfer, even if multiple
 *          HAL paths converge (e.g. ErrorCallback after a partial DMA).
 */
static void CallbackTxDone(I2CCallbacks& i2c_callbacks, bool success)
{
    if (i2c_callbacks.callbackTx)
    {
        std::function<void(bool)> handler;
        handler.swap(i2c_callbacks.callbackTx);
        handler(success);
    }
}

/**
 * \brief   Fire and clear the callbackRx slot.
 * \param   i2c_callbacks   Structure containing the callbackRx to call.
 * \param   success         True if the transfer completed successfully,
 *                          false on bus error or aborted transfer.
 * \details See CallbackTxDone for the once-per-transfer guarantee.
 */
static void CallbackRxDone(I2CCallbacks& i2c_callbacks, bool success)
{
    if (i2c_callbacks.callbackRx)
    {
        std::function<void(bool)> handler;
        handler.swap(i2c_callbacks.callbackRx);
        handler(success);
    }
}

/**
 * \brief   Blocking busy-wait of at least the requested microseconds.
 * \param   us  Number of microseconds to wait.
 * \details Uses the Cortex-M4 DWT cycle counter so the delay tracks the
 *          live core clock (SystemCoreClock) regardless of the board's
 *          PLL profile. Only the bit-banged bus recovery uses this, where
 *          ~100 kHz timing is non-critical (a slower clock is harmless).
 *          DWT->CYCCNT is never reset, so a concurrent DWT consumer (e.g.
 *          CpuWakeCounter) is left undisturbed; the wait is wrap-safe via
 *          unsigned subtraction.
 */
static void DelayMicroseconds(uint32_t us)
{
    if ((CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk) == 0) { CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; }
    if ((DWT->CTRL & DWT_CTRL_CYCCNTENA_Msk) == 0)            { DWT->CTRL       |= DWT_CTRL_CYCCNTENA_Msk;      }

    const uint32_t start  = DWT->CYCCNT;
    const uint32_t cycles = (SystemCoreClock / 1000000U) * us;
    while ((DWT->CYCCNT - start) < cycles) { }
}


/************************************************************************/
/* Public Methods                                                       */
/************************************************************************/
/**
 * \brief   Constructor, prepares the internal I2C instance administration.
 * \param   instance    The I2C instance to use.
 */
I2C::I2C(const I2CInstance& instance) :
    mInstance(instance),
    mI2CCallbacks( (instance == I2CInstance::I2C_1) ? (i2c1_callbacks) : ( (instance == I2CInstance::I2C_2) ? (i2c2_callbacks) : (i2c3_callbacks) ) ),
    mInitialized(false)
{
    SetInstance(instance);
}

/**
 * \brief   Destructor, disables interrupts.
 * \note    DisconnectCallbacks is also invoked unconditionally here as a
 *          safety net so a stale lambda capturing this object's `this`
 *          cannot be dispatched after destruction.
 */
I2C::~I2C()
{
    Sleep();
    DisconnectCallbacks();
}

/**
 * \brief   Initializes the I2C instance with the given configuration.
 * \param   config  The configuration for the I2C instance to use.
 * \returns True if the configuration could be applied, else false.
 */
bool I2C::Init(const IConfig& config)
{
    CheckAndEnablePeripheralClock(mInstance);

    EXPECT(config.ConfigId() == Config::Id());
    if (config.ConfigId() != Config::Id()) { return false; }

    const Config& cfg = static_cast<const Config&>(config);

    mHandle.Init.ClockSpeed      = (cfg.mBusSpeed == BusSpeed::NORMAL) ? 100000 : 400000;
    mHandle.Init.DutyCycle       = (cfg.mBusSpeed == BusSpeed::NORMAL) ? I2C_DUTYCYCLE_2 : I2C_DUTYCYCLE_16_9;
    mHandle.Init.OwnAddress1     = 0;
    mHandle.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    mHandle.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    mHandle.Init.OwnAddress2     = 0;
    mHandle.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    mHandle.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;

    if (HAL_I2C_Init(&mHandle) == HAL_OK)
    {
        // Configure NVIC to generate interrupt on Event
        SetIRQn(GetIRQn(mInstance, IRQType::EVENT), cfg.mInterruptPriority, 0);

        // Configure NVIC to generate interrupt on Error
        SetIRQn(GetIRQn(mInstance, IRQType::ERROR), cfg.mInterruptPriority, 0);

        mI2CCallbacks.callbackEvent = [this]() { this->CallbackEvent(); };
        mI2CCallbacks.callbackError = [this]() { this->CallbackError(); };

        mInitialized = true;
        return true;
    }
    return false;
}

/**
 * \brief   Indicate if I2C is initialized.
 * \returns True if I2C is initialized, else false.
 */
bool I2C::IsInit() const
{
    return mInitialized;
}

/**
 * \brief    Puts the I2C module in sleep mode.
 * \details Aborts ongoing transfers.
 * \returns True if I2C module could be put in sleep mode, else false.
 */
bool I2C::Sleep()
{
    // Abort only an in-flight master transfer; in any other state
    // HAL_I2C_Master_Abort_IT is a no-op. Result ignored so DeInit() runs.
    const HAL_I2C_StateTypeDef state = HAL_I2C_GetState(&mHandle);
    if ((state == HAL_I2C_STATE_BUSY_TX) || (state == HAL_I2C_STATE_BUSY_RX))
    {
        HAL_I2C_Master_Abort_IT(&mHandle, static_cast<uint16_t>(mHandle.Devaddress));
    }

    if (HAL_I2C_DeInit(&mHandle) != HAL_OK) { return false; }

