tlouwers/STM32F4-DISCOVERY/drivers/drivers/I2C/I2C.cpp
    mInitialized = false;

    HAL_NVIC_DisableIRQ( GetIRQn(mInstance, IRQType::EVENT) );
    HAL_NVIC_DisableIRQ( GetIRQn(mInstance, IRQType::ERROR) );

    DisconnectCallbacks();

    CheckAndDisablePeripheralClock(mInstance);
    return true;
}

/**
 * \brief   Recover a wedged I2C bus and restore the peripheral to its
 *          post-Init() state.
 * \param   scl     Pin id/port wired to this I2C's SCL line (the same
 *                  BoardConfig symbol used to set the bus up, e.g.
 *                  PIN_I2C1_SCL).
 * \param   sda     Pin id/port wired to this I2C's SDA line.
 * \returns True if the bus was recovered and the peripheral re-initialised;
 *          false if SDA stayed low after 9 clocks or re-init failed.
 * \details Combines two independent recoveries:
 *           1. Classic bus recovery -- with SCL/SDA driven as GPIO
 *              open-drain, up to 9 SCL pulses are issued while a slave
 *              clamps SDA low mid-byte, then a STOP is generated; this
 *              frees a stuck slave.
 *           2. STM32F4 ES0182 2.4.7 -- the analog filter can leave the
 *              BUSY flag stuck, blocking master-mode entry; the documented
 *              workaround disables PE, releases the lines via GPIO, then
 *              SWRSTs the peripheral.
 *          The pins are returned to AF4 open-drain (the I2C alternate
 *          function on every F407 I2C instance) and HAL_I2C_Init re-applies
 *          the original timing and re-enables the peripheral, so on success
 *          the bus is left exactly as after Init().
 * \note    Blocking; bit-bangs at roughly 100 kHz. Requires the peripheral
 *          to have been Init()'d -- the clock and handle must be live for
 *          the SWRST and re-init.
 */
bool I2C::RecoverBus(PinIdPort scl, PinIdPort sda)
{
    if (!mInitialized) { return false; }

    // ES0182 2.4.7 step 1: disable PE so the peripheral releases SCL/SDA.
    __HAL_I2C_DISABLE(&mHandle);

    // Drive both lines as GPIO open-drain, released high (the board's
    // external pull-ups float them high when not actively driven low).
    Pin sclPin(scl);
    Pin sdaPin(sda);
    sclPin.Configure(Level::HIGH, Drive::OPEN_DRAIN);
    sdaPin.Configure(Level::HIGH, Drive::OPEN_DRAIN);
    DelayMicroseconds(5);

    // Classic recovery: clock SCL until a slave clamping SDA lets go,
    // up to 9 pulses (one byte + ACK).
    for (uint8_t i = 0; (i < 9) && (sdaPin.Get() == Level::LOW); ++i)
    {
        sclPin.Set(Level::LOW);
        DelayMicroseconds(5);
        sclPin.Set(Level::HIGH);
        DelayMicroseconds(5);
    }

    const bool sdaReleased = (sdaPin.Get() == Level::HIGH);

    // Generate a clean STOP (SDA low->high while SCL high) so a slave that
    // was mid-transfer resynchronises to an idle bus. Drive SCL low *before*
    // pulling SDA low: at this point SCL is high (loop exit, or the initial
    // Configure when SDA was already released), so an SDA high->low edge here
    // would itself be a START (DS8626 6.3.19 / I2C-bus spec) and could re-arm
    // the very slave the 9 clocks just freed. Lowering SCL first keeps SDA's
    // falling edge off the START pattern.
    sclPin.Set(Level::LOW);
    DelayMicroseconds(5);
    sdaPin.Set(Level::LOW);
    DelayMicroseconds(5);
    sclPin.Set(Level::HIGH);
    DelayMicroseconds(5);
    sdaPin.Set(Level::HIGH);
    DelayMicroseconds(5);

    // Hand the lines back to the I2C peripheral. I2C1/2/3 are all AF4 on
    // the STM32F407; HIGHZ/OPEN_DRAIN matches the Board pin setup.
    sclPin.Configure(Alternate::AF4, PullUpDown::HIGHZ, Mode::OPEN_DRAIN);
    sdaPin.Configure(Alternate::AF4, PullUpDown::HIGHZ, Mode::OPEN_DRAIN);

    // ES0182 2.4.7: software reset clears the stuck BUSY flag.
    SET_BIT(mHandle.Instance->CR1, I2C_CR1_SWRST);
    CLEAR_BIT(mHandle.Instance->CR1, I2C_CR1_SWRST);

    // Re-apply the original configuration; HAL_I2C_Init ends by enabling
    // the peripheral, leaving the bus exactly as after Init().
    if (HAL_I2C_Init(&mHandle) != HAL_OK) { return false; }

    return sdaReleased;
}

/**
 * \brief   Link a configured DMA stream into the I2C's Tx or Rx slot.
 * \param   dma     A DMA object that has been Configure()'d. The peripheral
 *                  slot to wire (hdmatx / hdmarx) is picked from the DMA's
 *                  Direction: MemoryToPeripheral wires Tx, PeripheralToMemory
 *                  wires Rx.
 * \returns True if the DMA was linked, false if dma was not configured or
 *          its Direction is not Tx/Rx (e.g. MemoryToMemory).
 */
bool I2C::LinkDma(DMA& dma)
{
    if (!dma.IsConfigured()) { return false; }

    switch (dma.GetDirection())
    {
        case DMA::Direction::MemoryToPeripheral:
            __HAL_LINKDMA(&mHandle, hdmatx, *dma.Handle());
            return true;
        case DMA::Direction::PeripheralToMemory:
            __HAL_LINKDMA(&mHandle, hdmarx, *dma.Handle());
            mDmaRx = &dma;
            return true;
        default:
            return false;
    }
}

/**
 * \brief   Write data using DMA.
 * \param   slave       The slave address.
 * \param   src         Pointer to buffer with data to write.
 * \param   length      Length of the data to write in bytes.
 * \param   handler     Callback to call when write completed.
 * \returns True if the transaction could be started, else false. Returns false if no DMA is setup for Tx.
 * \note    Asserts if src is nullptr or length invalid.
 */
bool I2C::WriteDMA(uint8_t slave, const uint8_t* src, uint16_t length, const std::function<void(bool)>& handler)
{
    EXPECT(src);
    EXPECT(length > 0);

    // Note: HAL will NOT check on parameters
    if (nullptr == src) { return false; }
    if (0 == length)    { return false; }
    if (!mInitialized)  { return false; }
    if (nullptr == mHandle.hdmatx) { return false; }

    // Arm the handler only after the HAL accepts the transfer, bracketed by the
    // per-instance EV+ER NVIC mask (ScopedIrqMask): the std::function assignment
    // is not atomic and, once the transfer is live, the EV/ER ISR may read the
    // slot. A rejected start (HAL_BUSY/HAL_ERROR) leaves no stale handler armed.
    ScopedIrqMask mask(GetIRQn(mInstance, IRQType::EVENT), GetIRQn(mInstance, IRQType::ERROR));
    if (HAL_I2C_Master_Transmit_DMA(&mHandle, slave, const_cast<uint8_t*>(src), length) != HAL_OK) { return false; }
    mI2CCallbacks.callbackTx = handler;
    return true;
}

/**
 * \brief   Read data using DMA.
 * \param   slave       The slave address.
 * \param   dest        Pointer to buffer where to store the read data.
 * \param   length      Length of the data to read in bytes.
 * \param   handler     Callback to call when read completed.
 * \returns True if the transaction could be started, else false. Returns false
 *          if no DMA is setup for Rx.
 * \note    Asserts if dest is nullptr or length invalid.
 */
bool I2C::ReadDMA(uint8_t slave, uint8_t* dest, uint16_t length, const std::function<void(bool)>& handler)
{
    EXPECT(dest);
    EXPECT(length > 0);

    // Note: HAL will NOT check on parameters
    if (nullptr == dest) { return false; }
    if (0 == length)     { return false; }
    if (!mInitialized)   { return false; }
    if (nullptr == mHandle.hdmarx) { return false; }
    ASSERT(mDmaRx);     // hdmarx is only ever set alongside mDmaRx in LinkDma

    // See WriteDMA: arm the handler only on HAL_OK, under the EV+ER NVIC mask.
    ScopedIrqMask mask(GetIRQn(mInstance, IRQType::EVENT), GetIRQn(mInstance, IRQType::ERROR));
    if (HAL_I2C_Master_Receive_DMA(&mHandle, slave, dest, length) != HAL_OK) { return false; }
    mI2CCallbacks.callbackRx = handler;

    // HAL re-enables DMA_IT_HT regardless of the user's HalfBufferInterrupt
    // selection; reassert it.
    mDmaRx->EnforceHalfBufferInterruptSetting();
    return true;
}

/**
 * \brief   Write data using interrupts.
 * \param   slave       The slave address.
 * \param   src         Pointer to buffer with data to write.
 * \param   length      Length of the data to write in bytes.
 * \param   handler     Callback to call when write completed.
 * \returns True if the transaction could be started, else false.
 * \note    Asserts if src is nullptr or length invalid.
 */
bool I2C::WriteInterrupt(uint8_t slave, const uint8_t* src, uint16_t length, const std::function<void(bool)>& handler)
{
    EXPECT(src);
    EXPECT(length > 0);

    // Note: HAL will NOT check on parameters
    if (nullptr == src) { return false; }
    if (0 == length)    { return false; }
    if (!mInitialized)  { return false; }

    // See WriteDMA: arm the handler only on HAL_OK, under the EV+ER NVIC mask.
    ScopedIrqMask mask(GetIRQn(mInstance, IRQType::EVENT), GetIRQn(mInstance, IRQType::ERROR));
    if (HAL_I2C_Master_Transmit_IT(&mHandle, slave, const_cast<uint8_t*>(src), length) != HAL_OK) { return false; }
    mI2CCallbacks.callbackTx = handler;
    return true;
}

/**
 * \brief   Read data using interrupts.
 * \param   slave       The slave address.
 * \param   dest        Pointer to buffer where to store the read data.
 * \param   length      Length of the data to read in bytes.
 * \param   handler     Callback to call when read completed.
 * \returns True if the transaction could be started, else false.
 * \note    Asserts if dest is nullptr or length invalid.
 */
bool I2C::ReadInterrupt(uint8_t slave, uint8_t* dest, uint16_t length, const std::function<void(bool)>& handler)
{
    EXPECT(dest);
    EXPECT(length > 0);

    // Note: HAL will NOT check on parameters
    if (nullptr == dest) { return false; }
    if (0 == length)     { return false; }
    if (!mInitialized)   { return false; }

    // See WriteDMA: arm the handler only on HAL_OK, under the EV+ER NVIC mask.
    ScopedIrqMask mask(GetIRQn(mInstance, IRQType::EVENT), GetIRQn(mInstance, IRQType::ERROR));
    if (HAL_I2C_Master_Receive_IT(&mHandle, slave, dest, length) != HAL_OK) { return false; }
    mI2CCallbacks.callbackRx = handler;
    return true;
}

/**
 * \brief   Write data using blocking call.
 * \param   slave       The slave address.
 * \param   src         Pointer to buffer with data to write.
 * \param   length      Length of the data to write in bytes.
 * \returns True if the write was successful, else false.
 * \note    Asserts if src is nullptr or length invalid.
 */
bool I2C::WriteBlocking(uint8_t slave, const uint8_t* src, uint16_t length)
{
    EXPECT(src);
    EXPECT(length > 0);

    // Note: HAL will NOT check on parameters
    if (nullptr == src) { return false; }
    if (0 == length)    { return false; }
    if (!mInitialized)  { return false; }

    return (HAL_I2C_Master_Transmit(&mHandle, slave, const_cast<uint8_t*>(src), length, HAL_MAX_DELAY) == HAL_OK);
}

/**
 * \brief   Read data using blocking call.
 * \param   slave       The slave address.
 * \param   dest        Pointer to buffer where to store the read data.
 * \param   length      Length of the data to read in bytes.
 * \returns True if the read was successful, else false.
 * \note    Asserts if dest is nullptr or length invalid.
 */
bool I2C::ReadBlocking(uint8_t slave, uint8_t* dest, uint16_t length)
{
    EXPECT(dest);
    EXPECT(length > 0);

    // Note: HAL will NOT check on parameters
    if (nullptr == dest) { return false; }
    if (0 == length)     { return false; }
    if (!mInitialized)   { return false; }

