tlouwers/STM32F4-DISCOVERY/drivers/drivers/I2C/I2C.cpp
    return (HAL_I2C_Master_Receive(&mHandle, slave, dest, length, HAL_MAX_DELAY) == HAL_OK);
}


/************************************************************************/
/* Private Methods                                                      */
/************************************************************************/
/**
 * \brief   Set the I2C instance into internal administration.
 * \param   instance    The I2C instance to use.
 * \note    Asserts if the I2C instance is invalid.
 */
void I2C::SetInstance(const I2CInstance& instance)
{
    switch (instance)
    {
        case I2CInstance::I2C_1: mHandle.Instance = I2C1; break;
        case I2CInstance::I2C_2: mHandle.Instance = I2C2; break;
        case I2CInstance::I2C_3: mHandle.Instance = I2C3; break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }
}

/**
 * \brief   Enable the peripheral clock for the given I2C instance.
 * \param   instance    The I2C instance to enable the clock for.
 * \note    I2C1/2/3 all sit on APB1; the underlying __HAL_RCC_I2Cx_CLK_ENABLE
 *          macros target the correct bus.
 * \note    Asserts if not a valid I2C instance provided.
 */
void I2C::CheckAndEnablePeripheralClock(const I2CInstance& instance)
{
    switch (instance)
    {
        case I2CInstance::I2C_1: __HAL_RCC_I2C1_CLK_ENABLE(); break;
        case I2CInstance::I2C_2: __HAL_RCC_I2C2_CLK_ENABLE(); break;
        case I2CInstance::I2C_3: __HAL_RCC_I2C3_CLK_ENABLE(); break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }
}

/**
 * \brief   Disable the peripheral clock for the given I2C instance.
 * \param   instance    The I2C instance to disable the clock for.
 * \note    Asserts if not a valid I2C instance provided.
 */
void I2C::CheckAndDisablePeripheralClock(const I2CInstance& instance)
{
    switch (instance)
    {
        case I2CInstance::I2C_1: __HAL_RCC_I2C1_CLK_DISABLE(); break;
        case I2CInstance::I2C_2: __HAL_RCC_I2C2_CLK_DISABLE(); break;
        case I2CInstance::I2C_3: __HAL_RCC_I2C3_CLK_DISABLE(); break;
        default: ASSERT(false); while(1) { __NOP(); } break;    // Impossible selection
    }
}

/**
 * \brief   Get the IRQ belonging to the I2C.
 * \param   instance    The I2C instance to get the IRQ for.
 * \param   type        The IRQ type to get.
 * \returns The interrupt line IRQ to which the I2C belongs. If invalid
 *          instance provided this function will hang has no proper IRQ can be
 *          found.
 * \note    Asserts if not a valid I2C instance provided.
 */
IRQn_Type I2C::GetIRQn(const I2CInstance& instance, IRQType type)
{
    if (type == IRQType::EVENT)
    {
        switch (instance)
        {
            case I2CInstance::I2C_1: return I2C1_EV_IRQn; break;
            case I2CInstance::I2C_2: return I2C2_EV_IRQn; break;
            case I2CInstance::I2C_3: return I2C3_EV_IRQn; break;
            default: ASSERT(false); while(1) { __NOP(); } return I2C1_EV_IRQn; break;      // Impossible selection
        }
    }
    else
    {
        switch (instance)
        {
            case I2CInstance::I2C_1: return I2C1_ER_IRQn; break;
            case I2CInstance::I2C_2: return I2C2_ER_IRQn; break;
            case I2CInstance::I2C_3: return I2C3_ER_IRQn; break;
            default: ASSERT(false); while(1) { __NOP(); } return I2C1_ER_IRQn; break;      // Impossible selection
        }
    }
}

/**
 * \brief   Lower level configuration for the I2C interrupts.
 * \param   type        IRQn External interrupt number.
 * \param   preemptPrio The preemption priority for the IRQn channel.
 * \param   subPrio     The subpriority level for the IRQ channel.
 */
void I2C::SetIRQn(IRQn_Type type, uint32_t preemptPrio, uint32_t subPrio)
{
    HAL_NVIC_DisableIRQ(type);
    HAL_NVIC_ClearPendingIRQ(type);
    HAL_NVIC_SetPriority(type, preemptPrio, subPrio);
    HAL_NVIC_EnableIRQ(type);
}

/**
 * \brief   Generic I2C Event callback. Will propagate other interrupts.
 */
void I2C::CallbackEvent()
{
    HAL_I2C_EV_IRQHandler(&mHandle);
}

/**
 * \brief   Generic I2C Error callback. Will propagate other interrupts.
 */
void I2C::CallbackError()
{
    HAL_I2C_ER_IRQHandler(&mHandle);
}

/**
 * \brief   Clear every callback slot for this instance.
 * \details Called from Sleep() and from ~I2C() so a stale lambda capturing
 *          this object's `this` cannot be dispatched after the object goes
 *          away. Also clears any in-flight Tx/Rx user handler.
 */
void I2C::DisconnectCallbacks()
{
    mI2CCallbacks.callbackEvent = nullptr;
    mI2CCallbacks.callbackError = nullptr;
    mI2CCallbacks.callbackTx    = nullptr;
    mI2CCallbacks.callbackRx    = nullptr;
}


/************************************************************************/
/* Interrupts                                                           */
/************************************************************************/
/**
 * \brief   ISR: dispatch the I2C TX completed interrupt to the user handler.
 * \param   handle  The I2C handle from which the TX ISR came.
 * \details Checks ErrorCode defensively: HAL normally fires this callback
 *          only on success and routes failures to HAL_I2C_ErrorCallback,
 *          but we forward the actual outcome regardless so the contract
 *          documented on II2C holds even if HAL behaviour drifts.
 */
void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef* handle)
{
    ASSERT(handle);

    const bool success = (handle->ErrorCode == HAL_I2C_ERROR_NONE);

    if      (handle->Instance == I2C1) { CallbackTxDone(i2c1_callbacks, success); }
    else if (handle->Instance == I2C2) { CallbackTxDone(i2c2_callbacks, success); }
    else if (handle->Instance == I2C3) { CallbackTxDone(i2c3_callbacks, success); }
}

/**
 * \brief   ISR: dispatch the I2C RX completed interrupt to the user handler.
 * \param   handle  The I2C handle from which the RX ISR came.
 * \details See HAL_I2C_MasterTxCpltCallback for the ErrorCode rationale.
 */
void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef* handle)
{
    ASSERT(handle);

