tlouwers/STM32F4-DISCOVERY/drivers/drivers/I2C/I2C.cpp
    const bool success = (handle->ErrorCode == HAL_I2C_ERROR_NONE);

    if      (handle->Instance == I2C1) { CallbackRxDone(i2c1_callbacks, success); }
    else if (handle->Instance == I2C2) { CallbackRxDone(i2c2_callbacks, success); }
    else if (handle->Instance == I2C3) { CallbackRxDone(i2c3_callbacks, success); }
}

/**
 * \brief   ISR: dispatch a bus-error completion to whichever async handler
 *          is in flight, with success=false.
 * \param   handle  The I2C handle from which the error ISR came.
 * \details HAL routes failed transfers here instead of the success
 *          callbacks, so without this override the user's handler would
 *          never fire after a NACK/AF/BERR and the caller would deadlock
 *          waiting on it. In normal sequential flow only one of the Tx/Rx
 *          slots is non-null at a time (each is cleared after firing), so
 *          we dispatch both unconditionally.
 */
void HAL_I2C_ErrorCallback(I2C_HandleTypeDef* handle)
{
    ASSERT(handle);

    if      (handle->Instance == I2C1) { CallbackTxDone(i2c1_callbacks, false); CallbackRxDone(i2c1_callbacks, false); }
    else if (handle->Instance == I2C2) { CallbackTxDone(i2c2_callbacks, false); CallbackRxDone(i2c2_callbacks, false); }
    else if (handle->Instance == I2C3) { CallbackTxDone(i2c3_callbacks, false); CallbackRxDone(i2c3_callbacks, false); }
}

/**
 * \brief   ISR: dispatch an aborted transfer to whichever async handler
 *          is in flight, with success=false.
 * \param   handle  The I2C handle from which the abort completion came.
 * \details Sleep() calls HAL_I2C_Master_Abort_IT, which fires this
 *          callback rather than the Cplt or Error paths. The handler
 *          fires with success=false so the caller is not stranded; if
 *          DisconnectCallbacks has already cleared the slots (the abort
 *          completes after Sleep tears down) the dispatch is a no-op.
 */
void HAL_I2C_AbortCpltCallback(I2C_HandleTypeDef* handle)
{
    ASSERT(handle);

    if      (handle->Instance == I2C1) { CallbackTxDone(i2c1_callbacks, false); CallbackRxDone(i2c1_callbacks, false); }
    else if (handle->Instance == I2C2) { CallbackTxDone(i2c2_callbacks, false); CallbackRxDone(i2c2_callbacks, false); }
    else if (handle->Instance == I2C3) { CallbackTxDone(i2c3_callbacks, false); CallbackRxDone(i2c3_callbacks, false); }
}

/**
 * \brief   ISR: route I2C1 Event interrupts to 'CallbackEvent'.
 */
extern "C" void I2C1_EV_IRQHandler(void)
{
    CallbackEvent(i2c1_callbacks);
}

/**
 * \brief   ISR: route I2C1 Error interrupts to 'CallbackError'.
 */
extern "C" void I2C1_ER_IRQHandler(void)
{
    CallbackError(i2c1_callbacks);
}

/**
 * \brief   ISR: route I2C2 Event interrupts to 'CallbackEvent'.
 */
extern "C" void I2C2_EV_IRQHandler(void)
{
    CallbackEvent(i2c2_callbacks);
}

/**
 * \brief   ISR: route I2C2 Error interrupts to 'CallbackError'.
 */
extern "C" void I2C2_ER_IRQHandler(void)
{
    CallbackError(i2c2_callbacks);
}

/**
 * \brief   ISR: route I2C3 Event interrupts to 'CallbackEvent'.
 */
extern "C" void I2C3_EV_IRQHandler(void)
{
    CallbackEvent(i2c3_callbacks);
}

/**
 * \brief   ISR: route I2C3 Error interrupts to 'CallbackError'.
 */
extern "C" void I2C3_ER_IRQHandler(void)
{
    CallbackError(i2c3_callbacks);
}
